#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты
		.ВТранзакции()
		.Перед("ПодготовитьДанныеДляТестов")
		.ДобавитьТестовыйНабор("ПроведениеДокументов")
			.ДобавитьТест("ПроведениеПриходаТоваровПозитив", "", "Позитив")
			.ДобавитьТест("ПроведениеРасходаТоваровПозитив", "", "Позитив")
			.ДобавитьТест("ПроведениеРасходаТоваровНегатив", "", "Негатив")
		;
	
КонецПроцедуры

Процедура ПодготовитьДанныеДляТестов() Экспорт
	
	ЮТест.Контекст().УстановитьЗначение("Организация", НоваяОрганизация());
	ЮТест.Контекст().УстановитьЗначение("Контрагент", НовыйКонтрагент());
	ЮТест.Контекст().УстановитьЗначение("Склад", НовыйСклад());
	ЮТест.Контекст().УстановитьЗначение("Валюта", НоваяВалюта());
	ЮТест.Контекст().УстановитьЗначение("Товар", НовыйТовар());
		
КонецПроцедуры 

Процедура ПроведениеПриходаТоваровПозитив() Экспорт
	
	// 1. Подготовка параметров и генерация данных для выполнения функции.
	
	// 2. Выполнение функции.
	ПриходТовара = НовыйПриходТовара();
	
	// 3. Проверка результата.
	// Проверить, что каждый документ успешно создан
	ЮТест.ОжидаетЧто(ПриходТовара)
		.Заполнено()
		;
	
	ПриходОбъект = ПриходТовара.ПолучитьОбъект();
	// Проверить, что документ успешно проведен
	ЮТест.ОжидаетЧто(ПриходОбъект)
		.Метод("Записать", ЮТМетоды.МассивПараметров(РежимЗаписиДокумента.Проведение))
		.НеВыбрасываетИсключение()	
		;
	
	// Проверить, что документ содержит движения	
	ОписаниеЗапроса = ЮТЗапросы.ОписаниеЗапроса();
	ОписаниеЗапроса.ИмяТаблицы = "РегистрНакопления.ТоварныеЗапасы";
	ОписаниеЗапроса.Условия.Добавить("Регистратор = &Регистратор");
	ОписаниеЗапроса.ЗначенияПараметров.Вставить("Регистратор", ПриходТовара);

	ЮТест.ОжидаетЧто(ЮТЗапросы.РезультатПустой(ОписаниеЗапроса)).ЭтоЛожь();
		
КонецПроцедуры 

Процедура ПроведениеРасходаТоваровПозитив() Экспорт
	
	// 1. Подготовка параметров и генерация данных для выполнения функции.
	НовыйПриходТовара().ПолучитьОбъект().Записать(РежимЗаписиДокумента.Проведение); //Остаток = 10
	НовыйРасходТовара().ПолучитьОбъект().Записать(РежимЗаписиДокумента.Проведение); //Остаток = 5
	
	// 2. Выполнение функции.
	РасходТовара = НовыйРасходТовара();
	
	// 3. Проверка результата.
	ЮТест.ОжидаетЧто(РасходТовара)
		.Заполнено()
		;
	
	ЮТест.ОжидаетЧто(РасходТовара.ПолучитьОбъект())
		.Метод("Записать", ЮТМетоды.МассивПараметров(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный))
		.НеВыбрасываетИсключение()	
		;
		
	ОписаниеЗапроса = ЮТЗапросы.ОписаниеЗапроса();
	ОписаниеЗапроса.ИмяТаблицы = "РегистрНакопления.ТоварныеЗапасы";
	ОписаниеЗапроса.Условия.Добавить("Регистратор = &Регистратор");
	ОписаниеЗапроса.ЗначенияПараметров.Вставить("Регистратор", РасходТовара);

	ЮТест.ОжидаетЧто(ЮТЗапросы.РезультатПустой(ОписаниеЗапроса)).ЭтоЛожь();
	
	// Проверить, что движения по остаточным регистрам ТоварныеЗапасы и Взаиморасчеты выходят в ноль (в рамках созданных ранее документов)
	ОписаниеЗапроса = ЮТЗапросы.ОписаниеЗапроса();
	ОписаниеЗапроса.ИмяТаблицы = "РегистрНакопления.ТоварныеЗапасы.Остатки";
	ОписаниеЗапроса.Условия.Добавить("Товар = &Товар");
	ОписаниеЗапроса.Условия.Добавить("Склад = &Склад");
	ОписаниеЗапроса.ЗначенияПараметров.Вставить("Товар", ЮТест.Контекст().Значение("Товар"));
	ОписаниеЗапроса.ЗначенияПараметров.Вставить("Склад", ЮТест.Контекст().Значение("Склад"));

	ЮТест.ОжидаетЧто(ЮТЗапросы.РезультатПустой(ОписаниеЗапроса)).ЭтоИстина();
	
	ОписаниеЗапроса = ЮТЗапросы.ОписаниеЗапроса();
	ОписаниеЗапроса.ИмяТаблицы = "РегистрНакопления.Взаиморасчеты.Остатки";
	ОписаниеЗапроса.Условия.Добавить("Контрагент = &Контрагент");
	ОписаниеЗапроса.Условия.Добавить("Валюта = &Валюта");
	ОписаниеЗапроса.ЗначенияПараметров.Вставить("Контрагент", ЮТест.Контекст().Значение("Контрагент"));
	ОписаниеЗапроса.ЗначенияПараметров.Вставить("Валюта", ЮТест.Контекст().Значение("Валюта"));

	ЮТест.ОжидаетЧто(ЮТЗапросы.РезультатПустой(ОписаниеЗапроса))
		.ЭтоИстина();
		
КонецПроцедуры

Процедура ПроведениеРасходаТоваровНегатив() Экспорт
	
	// 1. Подготовка параметров и генерация данных для выполнения функции.
	НовыйПриходТовара().ПолучитьОбъект().Записать(РежимЗаписиДокумента.Проведение); //Остаток = 10
	НовыйРасходТовара().ПолучитьОбъект().Записать(РежимЗаписиДокумента.Проведение); //Остаток = 5
	НовыйРасходТовара().ПолучитьОбъект().Записать(РежимЗаписиДокумента.Проведение); //Остаток = 0
	
	// 2. Выполнение функции.
	РасходТовара = НовыйРасходТовара();
	
	// 3. Проверка результата.
	ЮТест.ОжидаетЧто(РасходТовара)
		.Заполнено()
		;
	
	ЮТест.ОжидаетЧто(РасходТовара.ПолучитьОбъект())
		.Метод("Записать", ЮТМетоды.МассивПараметров(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный))
		.ВыбрасываетИсключение("Не удалось провести ""Продажа")	
		;
		
	Сообщения = ПолучитьСообщенияПользователю();
	ЮТест.ОжидаетЧто(Сообщения)
		.ИмеетТип("ФиксированныйМассив")
		.ИмеетДлину(1)
		.Свойство("[0].Текст")
			.ИмеетТип("Строка")
			.Содержит("Не хватает 5 единиц товара""Тестовая номенклатура""")
		;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НовыйРасходТовара()
	
	РасходТовара = ЮТест.Данные().КонструкторОбъекта("Документ.РасходТовара")
		.ФикцияОбязательныхПолей()
		.Установить("Дата", ТекущаяДатаСеанса())
		.Установить("Организация", ЮТест.Контекст().Значение("Организация"))
		.Установить("Покупатель", ЮТест.Контекст().Значение("Контрагент"))
		.Установить("Склад", ЮТест.Контекст().Значение("Склад"))
		.Установить("Валюта", ЮТест.Контекст().Значение("Валюта"))
		.ТабличнаяЧасть("Товары")
			.ДобавитьСтроку()
				.Установить("Товар", ЮТест.Контекст().Значение("Товар"))
				.Установить("Количество", 5)
				.Установить("Цена", 700)
				.Установить("Сумма", 3500)
		.Записать();
		
	Возврат РасходТовара.Ссылка;
	
КонецФункции

Функция НовыйПриходТовара()
	
	ПриходТовара = ЮТест.Данные().КонструкторОбъекта("Документ.ПриходТовара")
		.ФикцияОбязательныхПолей()
		.Установить("Дата", ТекущаяДатаСеанса()-10)
		.Установить("Организация", ЮТест.Контекст().Значение("Организация"))
		.Установить("Поставщик", ЮТест.Контекст().Значение("Контрагент"))
		.Установить("Склад", ЮТест.Контекст().Значение("Склад"))
		.Установить("Валюта", ЮТест.Контекст().Значение("Валюта"))
		.ТабличнаяЧасть("Товары")
			.ДобавитьСтроку()
				.Установить("Товар", ЮТест.Контекст().Значение("Товар"))
				.Установить("Количество", 10)
				.Установить("Цена", 700)
				.Установить("Сумма", 7000)
		.Записать();
		
	Возврат ПриходТовара.Ссылка;
	
КонецФункции

Функция НовыйТовар()

    Товар = ЮТест.Данные().КонструкторОбъекта(Справочники.Товары)
        .ФикцияОбязательныхПолей()
		.Установить("Наименование", "Тестовая номенклатура")
		.Установить("Вид", Перечисления.ВидыТоваров.Товар) 
		.Записать();
		
	Возврат Товар;
		
КонецФункции

Функция НовыйСклад()

    Склад = ЮТест.Данные().КонструкторОбъекта(Справочники.Склады)
        .ФикцияОбязательныхПолей()
		.Установить("Наименование", "Тестовый склад")
		.Записать();
		
	Возврат Склад;
		
КонецФункции

Функция НовыйКонтрагент()

    Контрагент = ЮТест.Данные().КонструкторОбъекта(Справочники.Контрагенты)
        .ФикцияОбязательныхПолей()
		.Установить("Наименование", "Тестовый контрагент")
		.Записать();
		
	Возврат Контрагент;
		
КонецФункции

Функция НоваяВалюта()
	
	Валюта = ЮТест.Данные().КонструкторОбъекта(Справочники.Валюты)
		.ФикцияОбязательныхПолей()
		.Установить("Наименование", "Тестовая валюта")
		.Записать();
	
	Возврат Валюта;
	
КонецФункции

Функция НоваяОрганизация()
	
	Организация = ЮТест.Данные().КонструкторОбъекта(Справочники.Организации)
		.ФикцияОбязательныхПолей()
		.Установить("Наименование", "Тестовая организация")
		.Записать();
	
	Возврат Организация;
	
КонецФункции
#КонецОбласти