#Область ПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты.ДобавитьТестовыйНабор("Документ Расход товара: Проверка проведения").ВТранзакции()
		.ДобавитьТест("ПроведениеРасходаТоваров", "Проведение расхода товаров")
		.ДобавитьТест("ПроведениеЦепочкиДокументовПозитив", "Проведение цепочки документов", "Позитив")
		.ДобавитьТест("ПроведениеЦепочкиДокументовНегатив", "Проведение цепочки документов", "Негатив")
		;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроведениеРасходаТоваров() Экспорт
	
	// 1. Подготовка параметров и генерация данных для выполнения функции.
	ПриходТовара = ОМ_КонструкторыОбъектов.НовыйПриходТовара(5, 1000);
	ПриходТовара.ПолучитьОбъект().Записать(РежимЗаписиДокумента.Проведение);
	
	// 2. Выполнение функции.
	РасходТовара = ОМ_КонструкторыОбъектов.НовыйРасходТовара(ПриходТовара, 2, 1000);
	
	// 3. Проверка результата.
	ЮТест.ОжидаетЧто(РасходТовара)
		.Заполнено()
		;
	
	ЮТест.ОжидаетЧто(РасходТовара.ПолучитьОбъект())
		.Метод("Записать", ЮТМетоды.МассивПараметров(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный))
		.НеВыбрасываетИсключение()
		;
		
	ОписаниеЗапроса = ЮТЗапросы.ОписаниеЗапроса();
	ОписаниеЗапроса.ИмяТаблицы = "РегистрНакопления.ТоварныеЗапасы";
	ОписаниеЗапроса.Условия.Добавить("Регистратор = &Регистратор");
	ОписаниеЗапроса.ЗначенияПараметров.Вставить("Регистратор", РасходТовара);

	ЮТест.ОжидаетЧто(ЮТЗапросы.РезультатПустой(ОписаниеЗапроса)).ЭтоЛожь();
		
КонецПроцедуры

Процедура ПроведениеЦепочкиДокументовПозитив() Экспорт
	
	// 1. Подготовка параметров и генерация данных для выполнения функции.
	ПриходТовара = ОМ_КонструкторыОбъектов.НовыйПриходТовара(5, 1000);
	ПриходТовара.ПолучитьОбъект().Записать(РежимЗаписиДокумента.Проведение);
	
	РасходТовара1 = ОМ_КонструкторыОбъектов.НовыйРасходТовара(ПриходТовара, 2, 1000);
	РасходТовара1.ПолучитьОбъект().Записать(РежимЗаписиДокумента.Проведение);
	
	РасходТовара2 = ОМ_КонструкторыОбъектов.НовыйРасходТовара(ПриходТовара, 3, 1000);
	РасходТовара2.ПолучитьОбъект().Записать(РежимЗаписиДокумента.Проведение);
	
	// 2. Выполнение функции.
	
	// 3. Проверка результата.

	// Проверить, что движения по остаточным регистрам ТоварныеЗапасы и Взаиморасчеты выходят в ноль (в рамках созданных ранее документов)
	ОписаниеЗапроса = ЮТЗапросы.ОписаниеЗапроса();
	ОписаниеЗапроса.ИмяТаблицы = "РегистрНакопления.ТоварныеЗапасы.Остатки";
	ОписаниеЗапроса.Условия.Добавить("Товар = &Товар");
	ОписаниеЗапроса.Условия.Добавить("Склад = &Склад");
	ОписаниеЗапроса.ЗначенияПараметров.Вставить("Товар", ПриходТовара.Товары[0].Товар);
	ОписаниеЗапроса.ЗначенияПараметров.Вставить("Склад", ПриходТовара.Склад);

	ЮТест.ОжидаетЧто(ЮТЗапросы.РезультатПустой(ОписаниеЗапроса)).ЭтоИстина();
	
	ОписаниеЗапроса = ЮТЗапросы.ОписаниеЗапроса();
	ОписаниеЗапроса.ИмяТаблицы = "РегистрНакопления.Взаиморасчеты.Остатки";
	ОписаниеЗапроса.Условия.Добавить("Контрагент = &Контрагент");
	ОписаниеЗапроса.Условия.Добавить("Валюта = &Валюта");
	ОписаниеЗапроса.ЗначенияПараметров.Вставить("Контрагент", ПриходТовара.Поставщик);
	ОписаниеЗапроса.ЗначенияПараметров.Вставить("Валюта", ПриходТовара.Валюта);

	ЮТест.ОжидаетЧто(ЮТЗапросы.РезультатПустой(ОписаниеЗапроса))
		.ЭтоИстина();
		
	КонецПроцедуры
	
Процедура ПроведениеЦепочкиДокументовНегатив() Экспорт
	
	// 1. Подготовка параметров и генерация данных для выполнения функции.
	ПриходТовара = ОМ_КонструкторыОбъектов.НовыйПриходТовара(8, 1000);
	ПриходТовара.ПолучитьОбъект().Записать(РежимЗаписиДокумента.Проведение);
	
	РасходТовара1 = ОМ_КонструкторыОбъектов.НовыйРасходТовара(ПриходТовара, 2, 1000);
	РасходТовара1.ПолучитьОбъект().Записать(РежимЗаписиДокумента.Проведение);
	
	РасходТовара2 = ОМ_КонструкторыОбъектов.НовыйРасходТовара(ПриходТовара, 3, 1000);
	РасходТовара2.ПолучитьОбъект().Записать(РежимЗаписиДокумента.Проведение);
	
	// 2. Выполнение функции.
	РасходТовара3 = ОМ_КонструкторыОбъектов.НовыйРасходТовара(ПриходТовара, 4, 1000);
	
	// 3. Проверка результата.

	ЮТест.ОжидаетЧто(РасходТовара3)
		.Заполнено()
		;
	
	ЮТест.ОжидаетЧто(РасходТовара3.ПолучитьОбъект())
		.Метод("Записать", ЮТМетоды.МассивПараметров(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный))
		.ВыбрасываетИсключение("Не удалось провести ""Продажа")
		;
		
	Сообщения = ПолучитьСообщенияПользователю();
	ЮТест.ОжидаетЧто(Сообщения)
		.ИмеетТип("ФиксированныйМассив")
		.ИмеетДлину(1)
		.Свойство("[0].Текст")
			.ИмеетТип("Строка")
			.Содержит("Не хватает 1 единиц товара""Тестовая номенклатура""")
		;
		
КонецПроцедуры

#КонецОбласти



