
#Область ПрограммныйИнтерфейс

Функция НовыйПриходТовара(КоличествоТовара, Цена) Экспорт
	
	ПриходТовара = ЮТест.Данные().КонструкторОбъекта("Документ.ПриходТовара")
		.ФикцияОбязательныхПолей()
		.Установить("Дата", ТекущаяДатаСеанса()-10)
		.Установить("Организация", НоваяОрганизация())
		.Установить("Поставщик", НовыйКонтрагент())
		.Установить("Склад", НовыйСклад())
		.Установить("Валюта", НоваяВалюта())
		.ТабличнаяЧасть("Товары")
			.ДобавитьСтроку()
				.Установить("Товар", НовыйТовар())
				.Установить("Количество", КоличествоТовара)
				.Установить("Цена", Цена)
				.Установить("Сумма", КоличествоТовара * Цена)
		.Записать();
		
	Возврат ПриходТовара.Ссылка;
	
КонецФункции

Функция НовыйРасходТовара(ДокументОснование, КоличествоТовара, Цена) Экспорт
	
	РасходТовара = ЮТест.Данные().КонструкторОбъекта("Документ.РасходТовара")
		.ФикцияОбязательныхПолей()
		.Установить("Дата", ТекущаяДатаСеанса())
		.Установить("Организация", ДокументОснование.Организация)
		.Установить("Покупатель", ДокументОснование.Поставщик)
		.Установить("Склад", ДокументОснование.Склад)
		.Установить("Валюта", ДокументОснование.Валюта)
		.ТабличнаяЧасть("Товары")
			.ДобавитьСтроку()
				.Установить("Товар", ДокументОснование.Товары[0].Товар)
				.Установить("Количество", КоличествоТовара)
				.Установить("Цена", Цена)
				.Установить("Сумма", КоличествоТовара * Цена)
		.Записать();
		
	Возврат РасходТовара.Ссылка;
	
КонецФункции

Функция НовыйТовар() Экспорт
	
	Товар = ЮТест.Данные().КонструкторОбъекта(Справочники.Товары)
		.ФикцияОбязательныхПолей()
		.Установить("Наименование", "Тестовая номенклатура")
		.Установить("Вид", Перечисления.ВидыТоваров.Товар) 
		.Записать();
		
	Возврат Товар;
		
КонецФункции

Функция НовыйСклад() Экспорт

	Склад = ЮТест.Данные().КонструкторОбъекта(Справочники.Склады)
		.ФикцияОбязательныхПолей()
		.Установить("Наименование", "Тестовый склад")
		.Записать();
		
	Возврат Склад;
		
КонецФункции

Функция НовыйКонтрагент() Экспорт

	Контрагент = ЮТест.Данные().КонструкторОбъекта(Справочники.Контрагенты)
		.ФикцияОбязательныхПолей()
		.Установить("Наименование", "Тестовый контрагент")
		.Записать();
		
	Возврат Контрагент;
		
КонецФункции

Функция НоваяВалюта() Экспорт
	
	Валюта = ЮТест.Данные().КонструкторОбъекта(Справочники.Валюты)
		.ФикцияОбязательныхПолей()
		.Установить("Наименование", "Тестовая валюта")
		.Записать();
	
	Возврат Валюта;
	
КонецФункции

Функция НоваяОрганизация() Экспорт
	
	Организация = ЮТест.Данные().КонструкторОбъекта(Справочники.Организации)
		.ФикцияОбязательныхПолей()
		.Установить("Наименование", "Тестовая организация")
		.Записать();
	
	Возврат Организация;
	
КонецФункции


#КонецОбласти
