
Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты.ДобавитьТестовыйНабор("Документ Приход товара: Проверка проведения").ВТранзакции()
		.ДобавитьТест("ПроведениеПриходаТоваров", "Проведение прихода товаров")
		;

КонецПроцедуры

Процедура ПроведениеПриходаТоваров() Экспорт
	
	// 1. Подготовка параметров и генерация данных для выполнения функции.
	
	// 2. Выполнение функции.
	ПриходТовара = ОМ_КонструкторыОбъектов.НовыйПриходТовара(5, 1000);
	
	// 3. Проверка результата.
	// Проверить, что каждый документ успешно создан
	ЮТест.ОжидаетЧто(ПриходТовара)
		.Заполнено()
		;
	
	ПриходОбъект = ПриходТовара.ПолучитьОбъект();
	// Проверить, что документ успешно проведен
	ЮТест.ОжидаетЧто(ПриходОбъект)
		.Метод("Записать", ЮТМетоды.МассивПараметров(РежимЗаписиДокумента.Проведение))
		.НеВыбрасываетИсключение()
		;
	
	// Проверить, что документ содержит движения
	ОписаниеЗапроса = ЮТЗапросы.ОписаниеЗапроса();
	ОписаниеЗапроса.ИмяТаблицы = "РегистрНакопления.ТоварныеЗапасы";
	ОписаниеЗапроса.Условия.Добавить("Регистратор = &Регистратор");
	ОписаниеЗапроса.ЗначенияПараметров.Вставить("Регистратор", ПриходТовара);

	ЮТест.ОжидаетЧто(ЮТЗапросы.РезультатПустой(ОписаниеЗапроса)).ЭтоЛожь();

КонецПроцедуры